In [3]:
import pandas as pd
df = pd.DataFrame({'name':["nishant","sudhanshu","krish","navin"],'sirname':["kaushal","kumar","naik","reddy"]})
df

        name  sirname
0    nishant  kaushal
1  sudhanshu    kumar
2      krish     naik
3      navin    reddy

In [6]:
new_df = df.reindex([3,0,1,2])
new_df

        name  sirname
3      navin    reddy
0    nishant  kaushal
1  sudhanshu    kumar
2      krish     naik

In [7]:
df.loc[2]

name       krish
sirname     naik
Name: 2, dtype: object

In [8]:
new_df.iloc[2]

name       sudhanshu
sirname        kumar
Name: 1, dtype: object

the main difference between loc and iloc is the type of indexing used. loc uses label-based indexing while iloc uses integer-based indexing.